# сортировка пузырьком
def bubble_sort(lst):
    n = len(lst)
    for i in range(n - 1):  # Сколько всего элементов в списке
        for j in range(n - 1 - i):  # Сколько раз нужно пройти по списку
            if lst[j] > lst[j + 1]:  # Если элемент больше следующего
                lst[j], lst[j + 1] = lst[j + 1], lst[j]
    return lst


if __name__ == '__main__':
    numbers = [64, 34, 25, 12, 22, 11, 90]
    #         [34, 64, 25, 12, 22, 11, 90]
    #         [34, 25, 64, 12, 22, 11, 90]
    #         [34, 25, 12, 64, 22, 11, 90]
    #         [34, 25, 12, 22, 64, 11, 90]
    #         [34, 25, 12, 22, 11, 64, 90]

    #         [25, 34, 12, 22, 11, 64, 90]
    #         [25, 12, 34, 22, 11, 64, 90]
    #         [25, 12, 22, 34, 11, 64, 90]
    #         [25, 12, 22, 11, 34, 64, 90]

    #         [12, 25, 22, 11, 34, 64, 90]
    #         [12, 22, 25, 11, 34, 64, 90]
    #         [12, 22, 11, 25, 34, 64, 90]

    #         [12, 11, 22, 25, 34, 64, 90]
    #         [12, 11, 22, 25, 34, 64, 90]

    #         [11, 12, 22, 25, 34, 64, 90]

    print(bubble_sort(lst=numbers))
