age = 25  # Переменная хранит возраст
user_name = 'Alice'  # Имя пользователя
price = 199.99  # Цена товара

a = 25  # Непонятно, что это — возраст? Количество?
x = "Alice"  # Что значит x?
p = 199.99  # Это цена? Или что-то другое?

"""
Рекомендации:

1) Используйте только буквы, цифры и знак подчёркивания _ (но не начинайте имя с цифры!).
2) Название должно быть осмысленным, чтобы отражать назначение переменной.
3) Пишите в snake_case (слова разделяются нижним подчёркиванием), например: user_age, total_price.
4) Не используйте зарезервированные слова Python, такие как print, if, elif, else, for и так далее.

int (целое число): используется для чисел без дробной части. Пример: x = 5
float (число с плавающей точкой): для чисел с дробной частью. Пример: y = 3.14
str (строка): для текста. Пример: name = «Alice»
bool (булев тип): принимает значения True или False, полезен для проверки условий. Пример: is_valid = True
списки, словари, кортежи и множества. Их мы изучим позже.
"""